; domain
(define (domain yamaha-virago-oil-change)
  (:requirements :strips :typing)

  (:types
    item
    tool container liquid vehicle

    oil bung oil_filter oil_cap funnel - tool
    bike oil_tank can jug bottle - container
    old_oil new_oil - liquid
  )

  (:predicates
    ;;
    (in ?item - item ?loc - container)
    (on ?item - tool ?loc - container)

    ;;
    (attached ?bung - bung)
    (full ?item - item)
    (empty ?item - item)
    (dirty ?funnel - funnel)
    (clean ?funnel - funnel)
    (open ?oil_cap - oil_cap)
    (closed ?oil_cap - oil_cap)
    (out ?oil_filter - oil_filter)
    (in_filter ?oil_filter - oil_filter)
    (loose ?bung - bung)
    (away-from-bike ?bung - bung)
    (have_some ?oil - oil ?bung - bung)
  )

  ;;   ：
  (:action remove-bung
    :parameters (?oil - oil ?bung - bung ?bike - vehicle ?can - container)
    :precondition (and
                    (in ?oil ?bike)
                    (attached ?bung)
                    (full ?bung))
    :effect (and
              (in ?oil ?can)
              (not (attached ?bung))
              (have_some ?oil ?bung)
              )
  )

  ;;   ：
  (:action remove-oil-cap
    :parameters (?oil_cap - oil_cap ?oil_tank - container ?bung - bung ?bike - vehicle ?oil - oil)
    :precondition (and
                    (on ?oil_cap ?oil_tank)
                    (closed ?oil_cap)
                    (have_some ?oil ?bung)
                    )
    :effect (and
              (not (on ?oil_cap ?oil_tank))
              (open ?oil_cap)
              (not (in ?oil ?bike))
              (empty ?bung)
              )
  )

  ;;   ：
  (:action remove-oil-filter
    :parameters (?oil_filter - oil_filter ?oil_tank - container ?bike - vehicle ?oil - oil)
    :precondition (and (in_filter ?oil_filter) (not (in ?oil ?bike)))
    :effect (and
              (not (in_filter ?oil_filter))
              (out ?oil_filter)
              )
  )

  ;;   ：
  (:action screw-bung
    :parameters (?bung - bung ?bike - vehicle ?oil - oil ?oil_filter - oil_filter)
    :precondition (and
                    (away-from-bike ?bung)
                    (loose ?bung)
                    (out ?oil_filter)
                    (not (in ?oil ?bike)
                    )
                    )
    :effect (and
              (on ?bung ?bike)
              (attached ?bung))
  )

  ;;   ：
  (:action fill-oil
    :parameters (?new_oil - new_oil ?bottle - container ?oil_tank - container ?bung - bung ?bike - vehicle)
    :precondition (and
                    (empty ?new_oil)
                    (in ?new_oil ?bottle)
                    (on ?bung ?bike)
                    )
    :effect (and
              (full ?new_oil)
              (in ?new_oil ?oil_tank))
  )

  ;;   ：
  (:action recycle-old-oil
    :parameters (?old_oil - old_oil ?funnel - funnel ?can - container ?jug - container)
    :precondition (and
                    (in ?old_oil ?can)
                    (clean ?funnel))
    :effect (and
              (in ?old_oil ?jug)
              (dirty ?funnel))
  )

)

; problem
(define (problem yamaha-virago-oil-change-problem)
  (:domain yamaha-virago-oil-change)

  (:objects
    ;;
    oil1 - oil
    old_oil1 - old_oil
    new_oil1 - new_oil

    ;;
    bung1 - bung
    oil_cap1 - oil_cap
    oil_filter1 - oil_filter
    funnel1 - funnel

    ;;
    bike1 - vehicle
    oil_tank1 - container
    can1 - can
    jug1 - jug
    bottle1 - bottle
  )

  (:init
    ;;
    (in oil1 bike1) ; oil1
    (attached bung1)
    (full bung1)
    (on oil_cap1 oil_tank1)
    (closed oil_cap1)
    (in_filter oil_filter1)
    (full oil1)
    (clean funnel1)
    (in old_oil1 can1)
    (empty new_oil1)
    (in new_oil1 bottle1)

    ;;
    (loose bung1)
    (away-from-bike bung1)
  )

  (:goal
    (and
    ;;
      (open oil_cap1)

      ;;
      (out oil_filter1)
      ;;
      (in old_oil1 jug1)
      (dirty funnel1)

      ;;
      (in new_oil1 oil_tank1)
      (full new_oil1)

      ;;
      (attached bung1)
    )
  )
)

; plan
1. (remove-bung oil1 bung1 bike1 bottle1)
   deleted: (attached bung1)
   added: (in oil1 bottle1) (have_some oil1 bung1)
   goals met: 0 of 7
2. (remove-oil-cap oil_cap1 oil_tank1 bung1 bike1 oil1)
   deleted: (on oil_cap1 oil_tank1) (in oil1 bike1)
   added: (open oil_cap1) (empty bung1)
   goals met: 1 of 7
3. (remove-oil-filter oil_filter1 bottle1 bike1 oil1)
   deleted: (in_filter oil_filter1)
   added: (out oil_filter1)
   goals met: 2 of 7
4. (screw-bung bung1 bike1 oil1 oil_filter1)
   added: (on bung1 bike1) (attached bung1)
   goals met: 3 of 7
5. (recycle-old-oil old_oil1 funnel1 can1 jug1)
   added: (in old_oil1 jug1) (dirty funnel1)
   goals met: 5 of 7
6. (fill-oil new_oil1 bottle1 oil_tank1 bung1 bike1)
   added: (full new_oil1) (in new_oil1 oil_tank1)
   goals met: 7 of 7
